Проект_Услуги/src/Documents/ОказаниеУслуги/ОказаниеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОказаниеУслуги</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НаборСвойств</name>
      <type>
        <types>CatalogRef.ВариантыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Проект_Услуги/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.ВариантыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Проект_Услуги/src/AccumulationRegisters/СтоимостьМатериалов/СтоимостьМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьМатериалов</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Проект_Услуги/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Проект_Услуги/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Основной</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Основной.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Основной.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

Проект_Услуги/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

Проект_Услуги/src/ChartsOfAccounts/Основной/Основной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Основной</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41       </code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчеты с поставщиками</description>
      <code>60       </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ДебиторскаяЗадолженность</name>
      <description>Дебиторская задолженность</description>
      <code>62       </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>90       </code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Проект_Услуги/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Клиенты</types>
    <types>CatalogRef.Субконто</types>
    <types>String</types>
    <types>CatalogRef.Номенклатура</types>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>000000001</code>
      <type>
        <types>String</types>
        <types>CatalogRef.Номенклатура</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>Клиенты</name>
      <description>Клиенты</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Клиенты</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Проект_Услуги/src/Documents/ОказаниеУслуги/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
	// Создание менеджера временных таблиц
	МенеджерВТ = Новый МенеджерВременныхТаблиц;

#Область НоменклатураДокумента

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
	|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Количество) КАК КоличествоВДокументе,
	|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Сумма) КАК СуммаВДокументе,
	|	ОказаниеУслугиПереченьНоменклатуры.НаборСвойств
	|ПОМЕСТИТЬ НоменклатураДокумента
	|ИЗ
	|	Документ.ОказаниеУслуги.ПереченьНоменклатуры КАК ОказаниеУслугиПереченьНоменклатуры
	|ГДЕ
	|	ОказаниеУслугиПереченьНоменклатуры.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
	|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры,
	|	ОказаниеУслугиПереченьНоменклатуры.НаборСвойств";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

#КонецОбласти

#Область ДвиженияДокумента

	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст =
	"ВЫБРАТЬ
	|	НоменклатураДокумента.Номенклатура,
	|	НоменклатураДокумента.ВидНоменклатуры,
	|	НоменклатураДокумента.КоличествоВДокументе,
	|	НоменклатураДокумента.СуммаВДокументе,
	|	ЕСТЬNULL(СтоимостьМатериаловОстатки.СтоимостьОстаток, 0) КАК Стоимость,
	|	ЕСТЬNULL(ОстаткиМатериаловОстатки.КоличествоОстаток, 0) КАК Количество,
	|	НоменклатураДокумента.НаборСвойств
	|ИЗ
	|	НоменклатураДокумента КАК НоменклатураДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьМатериалов.Остатки(&Период, Материал В
	|			(ВЫБРАТЬ
	|				НоменклатураДокумента.Номенклатура
	|			ИЗ
	|				НоменклатураДокумента)) КАК СтоимостьМатериаловОстатки
	|		ПО НоменклатураДокумента.Номенклатура = СтоимостьМатериаловОстатки.Материал
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиМатериалов.Остатки(&Период, Материал В
	|			(ВЫБРАТЬ
	|				НоменклатураДокумента.Номенклатура
	|			ИЗ
	|				НоменклатураДокумента)) КАК ОстаткиМатериаловОстатки
	|		ПО НоменклатураДокумента.Номенклатура = ОстаткиМатериаловОстатки.Материал";
	Запрос2.УстановитьПараметр("Период", МоментВремени());

	Движения.ОстаткиМатериалов.БлокироватьДляИзменения = Истина;
	Движения.СтоимостьМатериалов.БлокироватьДляИзменения = Истина;

	РезультатЗапроса = Запрос2.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		Если Выборка.Количество = 0 Тогда
			СтоимостьМатериала = 0;
		Иначе
			СтоимостьМатериала = Выборка.Стоимость / Выборка.Количество;
		КонецЕсли;

		Если Выборка.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда
			// Регистр Остатки материалов Расход
			Движение = Движения.ОстаткиМатериалов.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Материал = Выборка.Номенклатура;
			Движение.НаборСвойств = Выборка.НаборСвойств;
			Движение.Склад = Склад;
			Движение.Количество = Выборка.КоличествоВДокументе;
			
			// Регистр Стоимость материалов Расход
			Движение = Движения.СтоимостьМатериалов.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Материал = Выборка.Номенклатура;
			Движение.Стоимость = Выборка.КоличествоВДокументе * СтоимостьМатериала;

		КонецЕсли;
		
			// Регистр Продажи
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Мастер = Мастер;
		Движение.Количество = Выборка.КоличествоВДокументе;
		Движение.Выручка = Выборка.СуммаВДокументе;
		Движение.Стоимость = Выборка.КоличествоВДокументе * СтоимостьМатериала;
		
		// Регистр Управленческий
		// Проводка Дт62 - Кт90
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.ДебиторскаяЗадолженность;
		Движение.СчетКт = ПланыСчетов.Основной.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = Выборка.СуммаВДокументе;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Клиенты] = Клиент;
		
		// Проводка Кр90 - Дт41
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Капитал;
		Движение.СчетКт = ПланыСчетов.Основной.Товары;
		Движение.Период = Дата;
		Движение.Сумма = СтоимостьМатериала * Выборка.КоличествоВДокументе;
		Движение.КоличествоКт = Выборка.КоличествоВДокументе;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = Выборка.Номенклатура;		

	КонецЦикла;
	
	Движения.Записать();

#КонецОбласти

#Область КонтрольОстатков

	Если Режим = РежимПроведенияДокумента.Оперативный Тогда

		Запрос3 = Новый Запрос;
		Запрос3.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос3.Текст =
		"ВЫБРАТЬ
		|	ОстаткиМатериаловОстатки.Материал,
		|	ОстаткиМатериаловОстатки.КоличествоОстаток,
		|	ОстаткиМатериаловОстатки.НаборСвойств
		|ИЗ
		|	РегистрНакопления.ОстаткиМатериалов.Остатки(, Материал В
		|		(ВЫБРАТЬ
		|			НоменклатураДокумента.Номенклатура
		|		ИЗ
		|			НоменклатураДокумента)
		|	И Склад = &Склад) КАК ОстаткиМатериаловОстатки
		|ГДЕ
		|	ОстаткиМатериаловОстатки.КоличествоОстаток < 0";
		Запрос3.УстановитьПараметр("Склад", Склад);

		РезультатЗапроса = Запрос3.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает " + Строка(-Выборка.КоличествоОстаток) +
			 " единиц материала " + Выборка.Материал + 
			 " из набора свойств " + Выборка.НаборСвойств;
			Сообщение.Сообщить();

			Отказ = Истина;

		КонецЦикла;

	КонецЕсли;

#КонецОбласти

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти



#КонецЕсли
